meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ":"Шутка",
            "АГРИТЬСЯ":"Злиться",
            "СКИЛЛ":"Умение",
            "ФИЧА":"бонус"
            }
print("добро пожаловать в словарь молодежного сленга")
while True:

    word = input("Введите непонятное слово (большими буквами!): ")
    if word.upper()in meme_dict.keys():
        print(meme_dict[word.upper()])
    elif word == "стоп":
        break
      
    else:
        print("такого слова в списке нет")
           
